/******************************************************************************
 *  CVS version:
 *     $Id: error.h,v 1.1 2005/04/07 10:31:32 nickie Exp $
 ******************************************************************************
 *
 *  C header file : error.h
 *  Project       : Llama Compiler
 *  Version       : 1.0 alpha
 *  Description   : Simple error handler
 *
 *  Comments: (in Greek iso-8859-7)
 *  ---------
 *  Εθνικό Μετσόβιο Πολυτεχνείο.
 *  Σχολή Ηλεκτρολόγων Μηχανικών και Μηχανικών Υπολογιστών.
 *  Τομέας Τεχνολογίας Πληροφορικής και Υπολογιστών.
 *  Εργαστήριο Τεχνολογίας Λογισμικού
 */


#ifndef __ERROR_H__
#define __ERROR_H__


/* ---------------------------------------------------------------------
   ---------------------------- Header files ---------------------------
   --------------------------------------------------------------------- */

#include <stdbool.h>


/* ---------------------------------------------------------------------
   ---------------------- Πλήθος σφαλμάτων, κ.λπ. ----------------------
   --------------------------------------------------------------------- */

extern int  numErrors;
extern int  maxErrors;
extern bool flagWarnings;
extern int  numWarnings;
extern int  maxWarnings;


/* ---------------------------------------------------------------------
   --------- Πρωτότυπα των συναρτήσεων του χειριστή σφαλμάτων ----------
   --------------------------------------------------------------------- */

#define internal(...) internal_raw(__FILE__, __LINE__, __VA_ARGS__)

void internal_raw (const char * fn, int lc, const char * fmt, ...);
void fatal        (const char * fmt, ...);
void error        (const char * fmt, ...);
void warning      (const char * fmt, ...);
void message      (const char * fmt, ...);


/* ---------------------------------------------------------------------
   -- Χρήσιμο για όσα θεωρούμε δεδομένα, αλλά μπορεί να μην είναι...  --
   --------------------------------------------------------------------- */

#ifdef CHECK_ASSERT
#define ASSERT(P) do { \
      if (!(P)) \
         internal_raw(__FILE__, __LINE__, \
                      "assertion violation: %s\n", #P); \
   } while(0)
#else
#define ASSERT(P)
#endif


#endif
